[{"_path":"/modules/testing/info","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Learning objectives","description":"In this module you will learn to answer the following questions:","type":"info","order":0,"_type":"markdown","_id":"local_fs:modules:testing:info.md","_source":"local_fs","_file":"modules/testing/info.md","_stem":"modules/testing/info","_extension":"md","plainText":"---\ntitle: Learning objectives\ntype: info\norder: 0\n---\n\nIn this module you will learn to answer the following questions:\n\n- Appreciate the importance of testing software\n- Understand the various benefits of testing\n- Understand the types of tests and what info they convey\n- Get familiar with the idea of continuous integration and its importance\n"},{"_path":"/modules/testing/self-test","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Self test","description":"","type":"exercise","order":5,"_type":"markdown","_id":"local_fs:modules:testing:self-test.md","_source":"local_fs","_file":"modules/testing/self-test.md","_stem":"modules/testing/self-test","_extension":"md","plainText":"---\ntitle: Self test\ntype: exercise\norder: 5\n---\n\n## Question A: What is software testing?\n\n1. A method for evaluating a software's compatibility with different operating systems.\n2. The process of releasing updates and patches for software.\n3. The process of verifying and validating that a software meets the required specifications and works as intended.\n4. A step in the software lifecycle focused on community engagement and feedback.\n5. The practice of documenting software functionalities.\n\n---\n\n## Question B: Why is software testing important?\n\n1. To build and maintain the community's trust by demonstrating commitment to quality.\n2. To identify and fix bugs, ensure the software meets required standards, and assess its reliability and reproducibility.\n3. To design the software's user interface and graphics.\n4. To accelerate the overall software development process.\n5. To facilitate easier collaboration among developers.\n\n---\n\n## Question C: Which best describes Continuous Integration and its benefits for this project?\n\n1. Continuous Integration is a practice where team members work in isolation to ensure their code is perfect before integrating it once at the end of the project, helping to avoid conflicts and errors.\n2. Continuous Integration involves the use of specialized software to automatically translate code into multiple programming languages, making it more versatile and reducing workload.\n3. Continuous Integration is a development practice where team members frequently integrate their work, often several times a day, to detect and fix integration issues early, thereby improving collaboration and code quality.\n4. Continuous Integration is a method where team members manually review each other's code at the end of each day, ensuring that the code meets quality standards and is ready for client presentation.\n5. Continuous Integration refers to the continuous updating of software to incorporate user feedback and new features, ensuring the software evolves to meet user needs.\n\n<small> **answers:** \nA: 3\nB: The most obvious answer is 2, but in fact all answers except 3 are correct\nC: 3\n</small>\n"}]