[{"_path":"/modules/testing/reading","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Reading material","description":"","type":"reading","order":7,"_type":"markdown","_id":"local_fs:modules:testing:reading.md","_source":"local_fs","_file":"modules/testing/reading.md","_stem":"modules/testing/reading","_extension":"md","plainText":"---\ntitle: Reading material\ntype: reading\norder: 7\n---\n\n# Reading material\n\n## Testing\nFollow the links below to read more about software testing.\n\n### The Turing Way\nRead in the Turing Way about [Code Testing](https://book.the-turing-way.org/reproducible-research/testing/).\n\n### Code Refinery\nRead in CodeRefinery about [Automated testing](https://coderefinery.github.io/testing/motivation/)\n\n### IBM\nLink to an [IBM article](https://www.ibm.com/topics/software-testing).\n\n### arXiv\nRead this interesting article about [Testing Research Software](https://arxiv.org/abs/2205.15982)\n\n## CI/CD\nFollow the links below to read more about CI/CD.\n\n### The Turing Way\nRead in the Turing Way about [Continuous Integration](https://book.the-turing-way.org/reproducible-research/ci/).\n\n### Code Refinery\nRead in CodeRefinery about [Continuous integration](https://coderefinery.github.io/testing/continuous-integration/)\n\n### ByteByteGo Newsletter\nRead in ByteByteGo newsletter about [A Crash Course in CI/CD](https://blog.bytebytego.com/p/a-crash-course-in-cicd)\n"},{"_path":"/modules/testing/slides","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Software Testing","description":"===","type":"slides","order":1,"_type":"markdown","_id":"local_fs:modules:testing:slides.md","_source":"local_fs","_file":"modules/testing/slides.md","_stem":"modules/testing/slides","_extension":"md","plainText":"---\ntitle: Software Testing\ntype: slides\norder: 1\n---\n\n<!-- .slide: data-state=\"title blue_overlay yellow_flag yellow_strip purple_half_circle_bottom purple_blob right_e_top\" -->\n\n# Software Testing\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### What is software testing?\n\n> Software testing is the process of evaluating and verifying that a software and its components meet specified requirements and work as expected. Its primary purpose is to identify defects, errors, flaws, or bugs early in the development process.\n\nNote:\n\nAs with any other engineering/scientific approach, it's important to check that the expected/required results of your software are accomplished. As such, software testing is analogous to testing lab protocols or (experimental) equipment before publication/putting it on the market.\n\n==\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Risks of poorly tested (research) software\n\n<center>\n<img src=\"media/testing-motivation1.png\" width=\"30%\" style=\"display:inline;\">\n<img src=\"media/testing-motivation2.png\" width=\"30%\" style=\"display:inline;\">\n<img src=\"media/testing-motivation3.png\" width=\"30%\" style=\"display:inline;\">\n</center>\n\n\n<small> Find the complete articles [here](https://www.science.org/doi/full/10.1126/science.314.5807.1856), [here](https://arstechnica.com/information-technology/2019/10/chemists-discover-cross-platform-python-scripts-not-so-cross-platform/), and [here](https://www.wired.com/2010/11/1110mars-climate-observer-report/) </small>\n\nNote:\n\nThere are several examples in which the lack of proper software testings resulted in serious consequences.\n\nThe first article from 2006 reports about a software flaw (a plus sign in place of a minus sign) that lead to a retraction of 5 scientific articles.\n\nIn the second from 2019, researchers found that a programming error in a set of Python scripts commonly used for computational analysis of chemistry data returned varying results based on which operating system they were run on—throwing doubt on the results of more than 150 published chemistry studies.\n\nThe loss of the Mars Climate Orbiter in 1999 is another prominent example of a catastrophe caused by a software error, specifically a unit conversion mistake.\n\nThere is also the case of the Ariane flight V88, an European Space Agency rocket which was destroyed just 40 seconds after its launch due to a software bug; see https://en.wikipedia.org/wiki/Ariane_flight_V88.\n\n==\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Why test your software ?\n\n- Ensure continued reliability and reproducibility\n- Boost developer confidence\n- Detect problems with (updated) dependencies early\n- Simplify and manage code complexity\n- Confirm correct installation and demonstrate use\n\nNote:\n\n- Ensuring software reliability, validity, and reproducibility for research software directly influences the reproducibility of the results obtained.\n- A good test suite gives collaborators and (external) contributors confidence to make modifications without breaking existing functionalities.\n- As mentioned before, software almost always relies on other software (its dependencies). As the dependencies change or get updated, your use of these depencies may also need to change. Having tests in place will detect such issues as soon as they arise and allow you stay ahead of the curve.\n- Code that is easy to test is often easier to understand and maintain. By writing good tests, you push yourself to write good code.\n- Tests can be used as an example or tutorial for (new) users to see how to use the software, or to test that their installation was successful.\n\n==\n\n<!-- .slide: data-state=\"standard\" -->\n\n### The Power of Automated Testing\n\nSoftware is inherently automatable: use its power to test itself!\n\n- Faster Execution – Runs tests in seconds/minutes vs. hours of manual testing.\n- Higher Accuracy – Eliminates human error, ensuring consistent results.\n- Early Detection – Identifies issues when they arise.\n- Scalability – Handles large test suites without extra effort.\n- Cost Efficiency – Saves time and resources in the long run.\n\nNote:\n\nDevelopers (and researchers) generally run a number of tests or test scripts manually at certain points in the development process. However, if we think of the problems mentioned in the previous slide, these would often not have been detected by manual testing.\n\nInstead, we would encourage developers to collect those (and more!) tests into a test suite and have them run systematically. Many programming languages have existing tools that helkp you create and run tests suits: [PyTest](https://docs.pytest.org/) for Python, [testthat](https://testthat.r-lib.org/) for R, [JUnit](https://junit.org/) for Java, etc.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Test types\n\n- **Smoke tests** verify that the essential functions of the software work.\n- **Unit tests** assess individual components for correctness.\n- **Integration tests** verify interactions between different parts of the software.\n- **System tests** evaluate the complete and integrated software system.\n- **Regression tests** ensure new changes don’t disrupt existing functionality.\n\nNote:\n\n- Smoke test: A preliminary test to verify that the essential functions of the software work. If a smoke test fails, further testing is halted until the issues are resolved.\n- Unit test: A test that verifies the functionality of an individual unit (e.g., a function, method, or module) in isolation. In unit tests each individual unit of a software is tested separately.\n- Integration test: A test that checks the interaction between integrated components or modules. Individual units (that are tested in isolation using unit tests) are combined and tested as a group. The goal is to detect faults in how these units work together, especially focusing on data flow, APIs, and dependencies.\n- System test: A test that evaluates the complete system as a whole to ensure it meets functional (correct results, no crashes, ...) and non-functional (security, performance, ...) requirements. It checks how different components interact under real-world conditions. It is similar to an integration test but broader in scope.\n- Regression tests: A test that ensures recent code changes haven't negatively affected existing functionality. This often involves re-running previous test cases to confirm that everything still works as expected.\n\n==\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Exercise\n\n[Identify the test types during the production of a pen.](exercise)\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Continuous Integration and Deployment (CI/CD)\n\nCI/CD is \"next level\" automation for your software project!\n\n<img src=\"https://blog.cloudhm.co.th/wp-content/uploads/2021/03/ci-cd.png\" width=\"50%\">\n<small> Image source: https://blog.cloudhm.co.th/ci-cd/ </small>\n\nNote:\n\nContinuous Integration (CI) is a practice in software development where team members regularly integrate their individual code changes, often several times a day, into a shared remote repository. After every integration, a working version of the project is built and the software's test suite is run automatically, making it possible to identify defects, errors, flaws, or bugs introduced by changes early in the development process. This helps keep the code up-to-date and reduces the chances of major issues when combining everyone's work.\n\nContinuous deployment (CD) is the practice of automatically deploying every working version of the project that passes the automated testing phase to its end-users.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Take home messages\n\n- Automated software testing is key for quality, reliability, and reproducibility\n- Unit tests verify individual components, integration tests check component interactions\n- CI/CD streamlines development and enhances deployment efficiency\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\n[www.esciencecenter.nl](https://www.esciencecenter.nl)\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"}]