[{"_path":"/modules/researchsoftware/exercise-is-it-research-software","_dir":"researchsoftware","_draft":false,"_partial":false,"_locale":"","title":"Is it Research Software?","description":"","type":"exercise","order":5,"_type":"markdown","_id":"local_fs:modules:researchsoftware:exercise-is-it-research-software.md","_source":"local_fs","_file":"modules/researchsoftware/exercise-is-it-research-software.md","_stem":"modules/researchsoftware/exercise-is-it-research-software","_extension":"md","plainText":"---\ntitle: Is it Research Software?\ntype: exercise\norder: 5\n---\n\n## Exercise: Is it research software?\n\nUsing the definition of research software from the FAIR4RS working group, try to classify the following as \"research software\" or \"software in research\"\n\n### Example software tools\n\n#### Shape Preserving Local Histogram Modification Algorithm\n[An Analysis and Implementation of the Shape Preserving Local Histogram Modification Algorithm](https://doi.org/10.5201/ipol.2018.236) is a published article on [IPOL](https://www.ipol.im/). The source code implementing the algorithm is available for download.\n\nIs this \"research software\" or \"software in research\"?\n\n#### SciPy\n[SciPy](https://zbmath.org/software/6293) is open-source software for mathematics, science, and engineering.\nIt is also the name of a very popular conference on scientific programming with Python. The SciPy library depends on NumPy, which provides convenient and fast N-dimensional array manipulation.\nThe SciPy library is built to work with NumPy arrays, and provides many user-friendly and efficient numerical routines such as routines for numerical integration and optimization.\nTogether, they run on all popular operating systems, are quick to install, and are free of charge.\nNumPy and SciPy are easy to use, but powerful enough to be depended upon by some of the world’s leading scientists and engineers.\n\nIs this \"research software\" or \"software in research\"?\n\n### Other software tools\nHow about other software tools you are familiar with?\nCan you provide an example of software you are familiar with, and then classify it as \"research software\" or \"software in research\"?\n"},{"_path":"/modules/researchsoftware/exercise-writing-software","_dir":"researchsoftware","_draft":false,"_partial":false,"_locale":"","title":"Writing Software","description":"","type":"exercise","order":2,"_type":"markdown","_id":"local_fs:modules:researchsoftware:exercise-writing-software.md","_source":"local_fs","_file":"modules/researchsoftware/exercise-writing-software.md","_stem":"modules/researchsoftware/exercise-writing-software","_extension":"md","plainText":"---\ntitle: Writing Software\ntype: exercise\norder: 2\n---\n\n## Writing software with Python (10 minutes)\n\n<img src=\"media/python-online.png\" width=\"70%\">\n<small>https://www.online-python.com/</small>\n\n### If you have never written software before:\n\n- Visit https://www.online-python.com/\n  - it will show you as an example the code for a function that adds items together.\n- Play around with the code a bit, e.g.\n  - Try using words instead of numbers as inputs. What happens and why?\n  - Add a function that subtracts items rather than adding them. What happens now if you use words instead of numbers, and why?\n  - What else can you do?\n\n### If you have experience in writing software:\n\n- Buddy up with someone from the above group.\n- Use the 4-eye principle (pair programming), to watch what they are doing and help them figure out what is going on and why.\n- Try to be conscious in explaining what is important and what your buddy needs to know without overcomplicating matters or taking over the keyboard.\n"}]