[{"_path":"/modules/version-control/version_control_exercise2","_dir":"version-control","_draft":false,"_partial":false,"_locale":"","title":"Tool search","description":"","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:version-control:version_control_exercise2.md","_source":"local_fs","_file":"modules/version-control/version_control_exercise2.md","_extension":"md","plainText":"---\ntitle: Tool search\ntype: exercise\norder: 4\n---\n\n## Exercise: tool search\n\nIn breakout groups of 3-4 people, identify 3 commonly used version control systems or tools that you have heard of (or used yourself) (for example: Git). \nTogether, search for a resource (such a website, or handbook) for each tool that helps explain how to use its key features.  "},{"_path":"/modules/version-control/version_control_terminology","_dir":"version-control","_draft":false,"_partial":false,"_locale":"","title":"Terminology","description":"","type":"reading","order":2,"_type":"markdown","_id":"local_fs:modules:version-control:version_control_terminology.md","_source":"local_fs","_file":"modules/version-control/version_control_terminology.md","_extension":"md","plainText":"---\ntitle: Terminology\ntype: reading\norder: 2\n---\n\n## Terminology\n* **Branch**: Branches allow different sets of changes to co-exist. In this way, multiple people can work on the same (set of) files, and different \"themed\" changes can be developed in isolation. The main branch, from which all other branches (indirectly) are derived is often called \"trunk\". In practice this is done by having multiple commits (see below) point to the same parent commit. Branches are usually intended to \"merge\" back into the main branch or trunk.\n* **Commit (noun)**: A commit or changeset is a set of alterations packaged together, along with meta-information  about the alterations. A commit/changeset describes the exact differences between two successive versions in the version control system's repository of changes along with information about the context of these changes, e.g. author, date, description (commit message) and a pointer to the parent commit.\n* **Commit (verb)**: To write the changes made in a working copy into the repository using a \"commit (noun, see above)\". \n* **Pull/push**: Copy revisions/commits from one repository into another. Pull is initiated by the receiving repository, while push is initiated by the source. Fetch is sometimes used as a synonym for pull, or to mean a pull followed by an update. \n* **Pull/merge request**: Contributions to a source code repository that uses a distributed version control system are commonly made by means of a pull request or merge request (synonyms). The contributor requests the project maintainer to pull their changes, hence the name \"pull request\". The maintainer has to merge the pull request if the contribution should become part of the source base.\n* **Repository**: In version control systems, a repository is a data structure that stores metadata for a set of files or directory structure.\n* **Working copy**: The working copy is the local copy of files from a repository. All work done to the files in a repository is initially done on a working copy, hence the name."}]