[{"_path":"/modules/documentation/ex_readme","_dir":"documentation","_draft":false,"_partial":false,"_locale":"","title":"Include a README file","description":"The README file is usually the first thing users/collaborators see when visiting your GitHub repository.\nUse it to communicate important information about your project! For many smaller or mid-size projects, this is enough documentation.\nIt’s not that hard to make a basic one, and it’s easy to expand as needed.","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:documentation:ex_readme.md","_source":"local_fs","_file":"modules/documentation/ex_readme.md","_extension":"md","plainText":"---\ntitle: Include a README file\ntype: exercise\norder: 4\n---\n\n\n# Include a README file\n\nThe README file is usually the first thing users/collaborators see when visiting your GitHub repository.\nUse it to communicate important information about your project! For many smaller or mid-size projects, this is enough documentation.\nIt’s not that hard to make a basic one, and it’s easy to expand as needed.\n\n- https://www.makeareadme.com/\n- https://gist.github.com/jxson/1784669\n"},{"_path":"/modules/documentation/exercise-which-documentation","_dir":"documentation","_draft":false,"_partial":false,"_locale":"","title":"When to use which documentation?","description":"Joanne is working on her research software 'WeatherMap' that analyses and summarizes measurements from weather stations.","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:documentation:exercise-which-documentation.md","_source":"local_fs","_file":"modules/documentation/exercise-which-documentation.md","_extension":"md","plainText":"---\ntitle: When to use which documentation?\ntype: exercise\norder: 4\n---\n\n# When to use which documentation?\nJoanne is working on her research software 'WeatherMap' that analyses and summarizes measurements from weather stations.\n\nHere is a list of possible forms of documentation:\n1. A basic README file containing: quick installation instructions, two lines explaining why the software was created, \ntwo basic examples of how you can use the software.\n2. A tutorial: 'Finding unusual patterns in daily average temperatures using WeatherMap'.\n3. In-code documentation: Comments in her code that explain why she made certain implementation choices.\n5. API reference: Detailed description of each function/class of WeatherMap.\n6. Overview of components: A detailed overview of each component in the software\n7. User documentation: Extensive documentation on how users can use each of the functionalities of WeatherMap\n8. Naming: Logical names for functions, modules and classes so that it is immediately clear what the corresponding piece of code does\n\n\nFor the following scenarios, which forms of documentation would you suggest Joanne to incorporate in her project:\n\n## Scenario A:\nJoanne just started her PhD and is the only one using WeatherMap to create results for her first paper. \nShe does not really care about anyone else using her software.\n\n## Scenario B:\nJoanne works together with a few other PhD students in her research group on the software. \nShe wants to make it easier for other researchers in her group to also adopt the software, \nand finds it important that when she moves on to a different job that the software can be still be used and improved in her absence.\n\n## Scenario C:\nJoanne and her colleagues spend half of their time updating and improving WeatherMap. \nThey have a large community of users around the globe that depend on WeatherMap for their research.\n\n"}]