[{"_path":"/modules/licenses/slides","_dir":"licenses","_draft":false,"_partial":false,"_locale":"","title":"Software Licensing","description":"","type":"slides","order":1,"_type":"markdown","_id":"local_fs:modules:licenses:slides.md","_source":"local_fs","_file":"modules/licenses/slides.md","_extension":"md","plainText":"---\ntitle: Software Licensing\ntype: slides\norder: 1\n---\n\n<!-- .slide: data-state=\"title\" -->\n\n## Software Licensing\n\n\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Common questions\n\n- Can I use this software I found online?\n- Can I share my software with others?\n- Can I contribute to someone else's software?\n\n\nNote:\n\nThere are three different things researchers do with software that are affected by licensing: using someone else's software, sharing your own software, and contributing to someone else's software (or having others contribute to yours).\n\nYou're probably most likely to get questions on the second topic, because the first is so commonly done that people either know the answer or don't know that it's even an issue, while the third one is still pretty rare in practice.\n\nSoftware is covered by copyright, and that's the main legal context in which we'll look at these questions here.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<div style=\"width: 70%; float: left; margin-top: 10%\">\n\n## About copyright\n\n- Berne convention on copyright\n- Owned by author or employer?\n- Can be licensed\n\n</div>\n\n<div style=\"width: 30%; float: right\">\n\n<img src=\"media/Zytgloggeturm_Bern.jpg\" width=\"100%\">\n\n</div>\n\n<div style=\"float: left; clear: both; padding-left: 25%; padding-top: 1em\">\n\n<small>Photo by <a href=\"//commons.wikimedia.org/wiki/User:JoachimKohler-HB\" title=\"User:JoachimKohler-HB\">JoachimKohler-HB</a> - <span class=\"int-own-work\" lang=\"en\">Own work</span>, <a href=\"https://creativecommons.org/licenses/by-sa/4.0\" title=\"Creative Commons Attribution-Share Alike 4.0\">CC BY-SA 4.0</a>, <a href=\"https://commons.wikimedia.org/w/index.php?curid=140063312\">Link</a></small>\n\n</div>\n\n\n\nNote:\n\nBy the Berne convention, software is automatically protected by copyright when it is made. Depending on the country, protection lasts 50 years or more. The owner of the copyright is the only one who can copy, publish, and modify the software.\n\nIf you make software as part of a job for an employer, then your employer owns the copyright. Otherwise, you are the owner (unless there's a contract somewhere that says otherwise).\n\nThe owner of the copyright on a work can give permission to others to do things they would otherwise not be allowed to do, like copying, publishing and modifying the work. A document that describes what they can do is called a copyright license. These licenses can be given to a specific party, usually as part of a contract, or they can be offered to the general public.\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Using others' software\n\n- Two ways of using software\n- You need a license\n- Licenses sometimes implicit, or home-made\n- Open Source is better and safer\n- Different Open Source licenses available\n\n\nNote:\n\nThere are two ways of using someone else's software: running it, and incorporating it into your own program. Both are covered by copyright, because you need to download and because you're making a derivative work.\n\nSo you need copyright permission, which is to say a license. In science, these are sometimes implied, by a researcher publishing the code without an explicit license, or home-made, which is not recommended because a non-expert will overlook many of the details of copyright law.\n\nIt's better if the software has an Open Source license, because these are professionally written and have standard, well-known meanings. We will go into that a bit more later. There are websites available that explain all the standard Open Source licenses in ordinary language, so that you can easily decide whether you can use a certain software package. You don't need to be (or have) a lawyer to use Open Source software.\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<div style=\"width: 50%; float: left\">\n\n## Why share software?\n\n- Reproducibility\n- Increasing impact\n- Academic freedom of employees\n- Saving by collaborating\n- Public funding\n\n</div>\n\n<div style=\"width: 40%; float: right\">\n<img src=\"media/Stephanie_Morales_Sharing.jpg\" width=\"100%\">\n</div>\n\n<div style=\"float: left; clear: both; padding-left: 35%; padding-top: 3em\">\n<small>Photo by <a href=\"https://unsplash.com/@stephaniemoarr?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Stephanie Morales</a> on <a href=\"https://unsplash.com/photos/person-holding-white-ceramic-mug-DGt9zA3Fr0g?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Unsplash</a></small>\n</div>\n\n\nNote:\n\nScientific software is sometimes shared, but also sometimes kept to themselves by the researchers making it. Here are some reasons that sharing scientific software is important:\n\n- Software is a scientific method, and it must be shared for the science to be reproducible.\n- Sharing software will bring users of the methods and citations to papers about it\n- Researchers frequently change jobs, moving from university to university. Without permission from their previous employers, they would have to start rebuilding their software from scratch every time they move to a new university, which would be very inefficient.\n- Many of the most pressing problems that scientist work on involve complex, multifaceted systems that can only be properly studied in collaboration. Where software is involved, which is to say almost everywhere in academic research, researchers need to be able to exchange software and collaborate on its development, including across projects.\n- The software was most likely funded with public money, and should therefore be available to the public, just like papers are published Open Access.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<div style=\"width: 50%; float: left\">\n\n## How to share software\n\n- Put it online\n- Add a license\n    1. Who owns the software?\n    2. Dependencies?\n    3. Kinds of licenses\n\n</div>\n\n<div style=\"width: 40%; float: right\">\n<img src=\"media/Stephanie_Morales_Sharing.jpg\" width=\"100%\">\n</div>\n\n<div style=\"float: left; clear: both; padding-left: 35%; padding-top: 3em\">\n<small>Photo by <a href=\"https://unsplash.com/@stephaniemoarr?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Stephanie Morales</a> on <a href=\"https://unsplash.com/photos/person-holding-white-ceramic-mug-DGt9zA3Fr0g?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Unsplash</a></small>\n</div>\n\n\nNote:\n\nTo share software effectively, you need to give it a license, preferably an Open Source one.\n\nTo do that, you need to be the owner of the copyright, or at least be able to act on behalf of the owners. This may be very simple but it can also be very complex. More on the next slide.\n\nThe next thing to consider is whether other software has been used in the software you've made (that's almost always the case) and how those so-called dependencies are licensed, as this may constrain your choice.\n\nFinally, different Open Source licenses specify different terms and conditions for use, and you need to decide what you want there.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Who owns a work?\n\n- Work for hire\n- Consortium agreements\n- Funding constraints\n\n\nNote:\n\nIn most countries, including The Netherlands, any work you do as part of your tasks as an employee of an organisation belongs to your employer, not to you. After all, they're paying you to do the work. This means that the copyright on any software written by a university employee is owned by the university.\n\nScience is often done in consortia, which are typically governed by a Consortium Agreement. Those often have a section on Intellectual Property that applies. Sadly those sections often don't mention copyright, but they do usually state that each partner gets to own the things they've made. That means that if your researcher has worked together on the software with researcher at one of the partners, that there are two owners that need to decide on licensing together.\n\nFunding may also come with restrictions or stipulations regarding ownership. For example, eScience Center grants come with a rule that says that both parties co-own the software, even if it was written by one of them, and that it will be published under the Apache License unless otherwise agreed.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Kinds of licenses\n\n<table style=\"border: 0.1em solid black; border-collapse: collapse; width: 100%\">\n    <tr align=\"center\" style=\"border: 0.1em solid black\">\n        <th colspan=\"3\" align=\"center\" style=\"border: 0.1em solid black\">Free and Open Source</th>\n        <th rowspan=\"3\" align=\"center\" valign=\"center\" style=\"border: 0.1em solid black\">Proprietary</th>\n    </tr>\n    <tr align=\"center\" style=\"border: 0.1em solid black\">\n        <th colspan=\"2\" align=\"center\" style=\"border: 0.1em solid black\">Copyleft</th>\n        <th rowspan=\"2\" align=\"center\" style=\"border: 0.1em solid black\">Permissive</th>\n    </tr>\n    <tr align=\"center\" style=\"border: 0.1em solid black\">\n        <th align=\"center\" style=\"border: 0.1em solid black\">Strong</th>\n        <th align=\"center\" style=\"border: 0.1em solid black\">Weak</th>\n    </tr>\n    <tr align=\"center\" style=\"border: 0.1em solid black\">\n      <td align=\"center\" style=\"border: 0.1em solid black; padding: 1em\">GPL<sup>1</sup> AGPL<sup>2</sup></td>\n      <td align=\"center\" style=\"border: 0.1em solid black; padding: 1em\">LGPL<sup>3</sup> MPL<sup>4</sup></td>\n      <td align=\"center\" style=\"border: 0.1em solid black; padding: 1em\">BSD<sup>5</sup> MIT<sup>6</sup> Apache</td>\n          <td align=\"center\" >Research only, No&nbsp;copying, No&nbsp;modification</td>\n    </tr>\n</table>\n<div style=\"margin-top: 1em; font-size: 70%; line-height: 2em\">\n  <sup>1</sup>GPL: GNU General Public License <sup>2</sup>AGPL: Affero General Public License <sup>3</sup>LGPL: GNU Lesser General Public License <sup>4</sup>MPL: Mozilla Public License <sup>5</sup>BSD: Berkeley Software Distribution <sup>6</sup>MIT: Massachusetts Institute of Technology\n</div>\n\n\nNote:\n\nSoftware licenses can be classified into different categories, which is helpful to get a quick idea for what kind of license you are dealing with. First, there are Open Source and non-Open Source licenses. Open Source licenses allow you to use the software, share it, change it, and share your changes. Proprietary software licenses do not allow one or more of these things. Note that this is not about being commercial, you can actually sell copies of Open Source programs, although you're not very likely to find buyers.\n\nCopyleft licenses say that if you modify the licensed software or incorporate it into your own, that that new software package must then be licensed under the same license. A permissive license allows licensing the new work under any license. As a result, copyleft software needs to remain open source, while permissively licensed software can be made proprietary.\n\nWithin the copyleft licenses we can distinguish strong copyleft, which covers both modified versions and use in other programs, from weak copyleft, which only limits modification. So a weak copyleft license keeps the licensed software package itself Open Source, but can be used as a part of proprietary software, while a strong copyleft license keeps the software from being used in (but not with) proprietary software (it is a bit vague legally where the limit is).\n\nFinally, the Affero GPL is designed for use with software that is designed to be installed on a server and accessed remotely, for example through a web browser. A normal copyleft license does not require the server owner to give a copy of the software running on the server to the users, while the AGPL does.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Choosing a license\n\n- Use a standard Open Source license\n- Check your policy (if applicable)\n- Use a tool\n\n\nNote:\n\nThe next step is to choose a license. If at all possible, use a standard Open Source license, because it will make everyone's lives much easier. Do not use Creative Commons licenses, as they're not designed for use with software.\n\nNext, check if your organisation has a policy that covers software licenses. Those are still a bit rare, but they're being worked on in many places so it's likely that you'll have one at some point. Check whether it specifies a particular license, or maybe a range of acceptable ones.\n\nFinally, there are some nice tools available that make it easier to select an Open Source license. We'll have a look at that in the exercise.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<div style=\"width: 50%; float: left\">\n\n## Contributing to software\n\n- Under the license\n- Contributor License Agreements\n    - Who are you dealing with?\n    - Transfer or license?\n\n</div>\n\n<div style=\"width: 50%; float: right\">\n<img src=\"media/Kleine_Dinge.jpg\" width=\"100%\">\n</div>\n\n<div style=\"float: left; clear: both; padding-left: 35%; padding-top: 3em\">\n<small>Photo by <a href=\"https://unsplash.com/@markkoenig?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Mark König</a> on <a href=\"https://unsplash.com/photos/white-and-green-quote-board-xCEuxxhpY3o?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Unsplash</a></small>\n</div>\n\n\nNote:\n\nThe most common way of contributing to an open source project is to do it under the license associated with the project. That means that you keep the copyright on your addition or modification, and license it under the same license as the existing code. This is the norm for small projects run by volunteers (or scientists). This case is similar to sharing your own code under a given license.\n\nLarger, more professionally run Open Source projects sometimes require a Contributor License Agreement. This is a contract that states what the recipient of your improvement can do with it. These are not standardised, so the contents vary.\n\nWhen evaluating these, it's good to look at who you're dealing with. A commercial entity, like Google, or a governance organisation like the Apache Foundation. The latter non-profit offers support for Open Source projects, including making sure that everything is properly licensed. Google is of course a commercial entity.\n\nSome CLAs require you to transfer ownership of the copyright on your contribution to someone else, which can be a good idea if that sole copyright holder can be trusted, for example because it makes it easier to upgrade the license. It may also allow them to turn your work proprietary however. In other cases, you're just giving explicit permission to distribute your contribution as Open Source software, which seems more just.\n\nIn general with CLAs, you should be careful with commercial entities (state aid!), and it's in any case probably wise to get your legal department involved.\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\nwww.esciencecenter.nl\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"},{"_path":"/modules/publication/automating_software_publication","_dir":"publication","_draft":false,"_partial":false,"_locale":"","title":"Automating publication","description":"Most of the steps in the modern software publishing pipeline can be automated.","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:publication:automating_software_publication.md","_source":"local_fs","_file":"modules/publication/automating_software_publication.md","_extension":"md","plainText":"---\ntitle: Automating publication\ntype: exercise\norder: 4\n---\n\n# Automating software publication\n\nMost of the steps in the modern software publishing pipeline can be automated.\n\n### An example with GitHub-Zenodo integration\n1. Choose a software repository on GitHub that you own (either existing, or create a new one).\n2. Navigate to [zenodo.org](https://zenodo.org/)\n3. Log in with your Zenodo account (create a new one if necessary)\n4. Navigate to the \"GitHub\" tab, located in a drop-down menu under your username\n5. Follow the instructions there to link your GitHub account with Zenodo (if not already done)\n6. Look through the list of repositories listed until you find the one you wanted to archive\n7. Flip the toggle on the right to \"ON\"\n8. Go back to your repository on github.com and make a new release. Zenodo will automatically archive this release.\n9. Add the Zenodo badge for your repository to the README file."}]