[{"_path":"/modules/researchsoftware/slides-researchsoftware","_dir":"researchsoftware","_draft":false,"_partial":false,"_locale":"","title":"Research Software","description":"===","type":"slides","order":3,"_type":"markdown","_id":"local_fs:modules:researchsoftware:slides-researchsoftware.md","_source":"local_fs","_file":"modules/researchsoftware/slides-researchsoftware.md","_extension":"md","plainText":"---\ntitle: Research Software\ntype: slides\norder: 3\n---\n\n<!-- .slide: data-state=\"title\" -->\n\n# Research software\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## *Ceci n'est pas une photo*\n\n<center>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Black_hole_-_Messier_87_crop_max_res.jpg/1280px-Black_hole_-_Messier_87_crop_max_res.jpg\" width=\"55%\">\n</center>\n\n<small>[The Event Horizon Telescope Collaboration et al. 2019](https://doi.org/10.3847/2041-8213/ab0ec7) (CC BY 3.0)</small>\n\nNote:\n\nSoftware plays an important role in science. A first thought may be its role in data collection and analysis. Further, it may play a role in designing experiments, based on models generated. It may _be_ the experiment itself, simulate a research outcome based on data or ideas entered; it may also be the \"brain\" behind controlling crucial instrumentation.\n\nWhat scientific software can you think of?\n\nWhat role does it play?\n\nAn example here: the Event Horizon Telescope, which took a \"picture\" of a black hole.\nThe \"telescope\" is not a single tool, but complex: a \"planet-scale array of eight ground-based radio telescopes\" (wikipedia).\nThe separate telescopes collect data that is synchronized with atomic clocks, and the data is combined at highly specialised supercomputers.\nThe data can be converted into an image using custom software.\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## The research lifecycle\n\n<center>\n<img src=\"media/researchcycle.png\" alt=\"The Research Life Cycle\" width=\"55%\"/>\n</center>\n\n<small>Software is used all across the research lifecycle</small>\n\nNote:\n\nSoftware is used all across the research life cycle.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/definition.png\" width=\"55%\">\n</center>\n\n<small>definition of Research Software from the FAIR4RS working group</small>\n\nNote:\n\nA definition of research software, from the FAIR4RS working group.\nIt is important that not all software that is used in research is research software.\nFor example, a text editor that is used to write a paper is not research software.\nNor is powerpoint, a web browser, or the software used to guide the telescope.\nEven tools like R or Python are not necessarily research software.\nThe code written in R or Python for an analysis would be research software, however.\nJust like a custom-made Excel macro that is used to analyse data.\nOr a custom-made web application that is used to collect data.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Why the distinction?\n\n- Research software is an important asset and output of research\n- Enable proper attribution\n- Increase Findability and Reuse\n\nNote:\n\nThe distinction is important\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Take home messages\n\n- Software is an important part of research\n- Not all software used in research is research software\n- It is important to regard research software in the whole research lifecycle\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\nwww.esciencecenter.nl\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"},{"_path":"/modules/researchsoftware/software-and-data","_dir":"researchsoftware","_draft":false,"_partial":false,"_locale":"","title":"Software and data","description":"","type":"reading","order":2,"_type":"markdown","_id":"local_fs:modules:researchsoftware:software-and-data.md","_source":"local_fs","_file":"modules/researchsoftware/software-and-data.md","_extension":"md","plainText":"---\ntitle: Software and data\ntype: reading\norder: 2\n---\n\n### Software is data (10 minutes, optional)\nIn computer science, the fact that software is data is considered one of the fundamental concepts of computing. The fact that the thing that operates the machine (software) is the same kind of thing as the thing it operates on (data) is definitely one of the strengths of current computersystems and one of the main reasons why we can do such complex and powerful things with the combination of hardware and software.\n\nRead the following blogpost about why this concept is so powerful:\nhttps://www.blackliszt.com/2014/04/fundamental-concepts-of-computing-software-is-data.html\n\n\n### Software is a special type of data (10 minutes, optional)\nHowever for most practical purposes in most domains of scientific research (except maybe the domain of computer science) it is useful to make a distinction between the data that is software and other data. From now on, when we use the word data, we mean the kind fo data which is not software and which we use to store more static information.\n\n- Software is executable, data is not.\n- Data provides information or evidence, software provides a tool to do work on the data.\n- Software is a creative work, scientific data are facts or observations.\n- The lifetime of software is generally not as long as that of data.\n\n\nhttps://github.com/danielskatz/software-vs-data\n\nhttps://doi.org/10.7287/peerj.preprints.2630v1\n\n\n### Discussion\n\n- Can you think of examples where the line between software and data becomes fuzzy?\n"}]