[{"_path":"/modules/citation/principles","_dir":"citation","_draft":false,"_partial":false,"_locale":"","title":"The principles","description":"","type":"reading","order":3,"_type":"markdown","_id":"local_fs:modules:citation:principles.md","_source":"local_fs","_file":"modules/citation/principles.md","_extension":"md","plainText":"---\ntitle: The principles\ntype: reading\norder: 3\n---\n\n### The software citation principles\nThe FORCE11 working group published the [Software Citation Principles](https://force11.org/info/software-citation-principles-published-2016/)\n\n**Importance**: Software should be considered a legitimate and citable product of research. Software citations should be accorded the same importance in the scholarly record as citations of other research products, such as publications and data; they should be included in the metadata of the citing work, for example in the reference list of a journal article, and should not be omitted or separated. Software should be cited on the same basis as any other research product such as a paper or a book, that is, authors should cite the appropriate set of software products just as they cite the appropriate set of papers.\n\n**Credit and Attribution**: Software citations should facilitate giving scholarly credit and normative, legal attribution to all contributors to the software, recognizing that a single style or mechanism of attribution may not be applicable to all software.\n\n**Unique Identification**: A software citation should include a method for identification that is machine actionable, globally unique, interoperable, and recognized by at least a community of the corresponding domain experts, and preferably by general public researchers.\n\n**Persistence**: Unique identifiers and metadata describing the software and its disposition should persist – even beyond the lifespan of the software they describe.\n\n**Accessibility**: Software citations should facilitate access to the software itself and to its associated metadata, documentation, data, and other materials necessary for both humans and machines to make informed use of the referenced software.\n\n**Specificity**: Software citations should facilitate identification of, and access to, the specific version of software that was used. Software identification should be as specific as necessary, such as using version numbers, revision numbers, or variants such as platforms.\n"},{"_path":"/modules/documentation/ex_readme","_dir":"documentation","_draft":false,"_partial":false,"_locale":"","title":"Include a README file","description":"The README file is usually the first thing users/collaborators see when visiting your GitHub repository.\nUse it to communicate important information about your project! For many smaller or mid-size projects, this is enough documentation.\nIt’s not that hard to make a basic one, and it’s easy to expand as needed.","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:documentation:ex_readme.md","_source":"local_fs","_file":"modules/documentation/ex_readme.md","_extension":"md","plainText":"---\ntitle: Include a README file\ntype: exercise\norder: 4\n---\n\n\n# Include a README file\n\nThe README file is usually the first thing users/collaborators see when visiting your GitHub repository.\nUse it to communicate important information about your project! For many smaller or mid-size projects, this is enough documentation.\nIt’s not that hard to make a basic one, and it’s easy to expand as needed.\n\n- https://www.makeareadme.com/\n- https://gist.github.com/jxson/1784669\n"}]