[{"_path":"/modules/softwarelandscape/exercise2","_dir":"softwarelandscape","_draft":false,"_partial":false,"_locale":"","title":"Mapping the principles","description":"","type":"exercise","order":3,"_type":"markdown","_id":"local_fs:modules:softwarelandscape:exercise2.md","_source":"local_fs","_file":"modules/softwarelandscape/exercise2.md","_extension":"md","plainText":"---\ntitle: Mapping the principles\ntype: exercise\norder: 3\n---\n\n## **Exercise:** Mapping the principles\n\nChoose one of the three examples of software below. They have been described with statements that can be mapped to the FAIR4RS Principles. With each statement in the software description, identify the principle(s) it maps to, and the (sub)facet(s) of the principle(s) it addresses. A single statement may map to multiple (sub)facets.\n\n![FAIR for Research Software principles](media/fair4rs_principles.png)\n\n\n### Software 1: [Comet](https://doi.org/10.1002/pmic.201200439)\n\n[Comet](https://doi.org/10.1002/pmic.201200439) is a command-line tool and desktop application for tandem mass spectrometry sequence database search6.\n\n- Comet is licensed under the Apache 2.0 open source licence.\n- Comet is registered in the bio.tools catalogue of bioinformatics tools, where it has a globally unique and persistent identifier, and rich metadata that includes the identifier and is searchable and indexable.\n- The metadata in bio.tools is independent from the Comet repository, and will stay accessible should the software itself become inaccessible.\n- The publicly accessible project repository on GitHub includes detailed information about the development of Comet.\n- The code includes dependencies to external software packages, such as Thermo Scientific’s MSFileReader library.\n- Comet can be downloaded via the browser following the links provided in the metadata using https.\n- Comet uses standard data types from the proteomics domain for its input and output data that are documented in the metadata as functional annotations.\n\n### Software 2: [PureGoMe](https://doi.org/10.5281/zenodo.4337242)\n\n[PureGoMe](https://doi.org/10.5281/zenodo.4337242) is a project aimed at understanding Dutch public sentiment during the COVID-19 outbreak period by analysing real-time Twitter data. It provides a collection of Python scripts and Jupyter notebooks for this purpose.\n\n- PureGoMe can be downloaded from the project repository, while metadata is accessible independently from the registry.\n- PuReGoMe's GitHub repository has detailed records of the development history.\n- The code includes dependencies to other software, such as various Python libraries.\n- PuReGoMe has a (versioned) DOI from Zenodo.\n- PuReGoMe uses the Apache 2.0 open source licence.\n- PuReGoMe uses standard file formats (e.g., CSV files) for data exchange.\n- PuReGoMe refers to other objects such as websites.\n- PureGoMe is registered in the Research Software Directory that captures the most relevant metadata, including the identifier, in searchable and indexable form.\n\n### Software 3: [gammaShiny](https://doi.org/10.5281/zenodo.4139005)\n\n[gammaShiny](https://doi.org/10.5281/zenodo.4139005) is an application that provides enhanced graphical user interfaces for the R gamma package8. It is used to process in-situ gamma-ray spectrometry measurements for luminescence dating.\n\n- gammaShiny has been deposited in the HAL French national archive and it has a persistent globally unique identifier, with the HAL identifier of the metadata record and a SWHID, identifying specifically the software artefact on the Software Heritage universal software source code archive.\n- Thanks to the HAL platform, where a licence is mandatory, gammaShiny is under a GNU General Public Licence v3.0.\n- The archived versions of gammaShiny’s source code in Software Heritage include a codemeta.json file, identifiable with a SWHID, where other metadata is available including dependencies named in CodeMeta (\"softwareRequirements\").\n\n### Do you agree?\n\nThe examples were taken from [this paper](https://doi.org/10.1038/s41597-022-01710-x).\nIn the Results section of the paper you will find the authors' analysis of the software, which contains the statements above, mapped to the FAIR4RS Principles.\n\nDo you agree with their assessment?"},{"_path":"/modules/softwarelandscape","_dir":"modules","_draft":false,"_partial":false,"_locale":"","title":"Software in the Scientific Landscape","description":"Photo by Kalen Emsley on Unsplash","category":"Getting started","order":13,"abstract":"What role does software play in the scientific landscape?","author":"eScience Center","thumbnail":"thumbnail-landscape.jpg","visibility":"visible","_type":"markdown","_id":"local_fs:modules:softwarelandscape:index.md","_source":"local_fs","_file":"modules/softwarelandscape/index.md","_extension":"md","plainText":"---\ntitle: Software in the Scientific Landscape\ncategory: Getting started\norder: 13\nabstract: What role does software play in the scientific landscape? \nauthor: eScience Center\nthumbnail: \"thumbnail-landscape.jpg\"\nvisibility: visible\n---\n\nPhoto by <a href=\"https://unsplash.com/@kalenemsley?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Kalen Emsley</a> on <a href=\"https://unsplash.com/photos/green-mountain-across-body-of-water-Bkci_8qcdvQ?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash\">Unsplash</a>\n  \n"}]