[{"_path":"/contributing","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Contributing to this Research Software Support platform","description":"In the Research Software Support modules we want to provide a comprehensive overview of the different aspects of Research Software and how to provide support to researchers.\nThis, as you can imagine, is no easy feat, and we need your help!\nSo first of all, thank you very much for your interest in contributing to this project.","_type":"markdown","_id":"local_fs:CONTRIBUTING.md","_source":"local_fs","_file":"CONTRIBUTING.md","_stem":"CONTRIBUTING","_extension":"md","plainText":"# Contributing to this Research Software Support platform\n\nIn the Research Software Support modules we want to provide a comprehensive overview of the different aspects of Research Software and how to provide support to researchers.\nThis, as you can imagine, is no easy feat, and we need your help!\nSo first of all, thank you very much for your interest in contributing to this project.\n\n### What can I do?\n\n- Contribute to the content discussion in the [module issues](https://github.com/esciencecenter-digital-skills/research-software-support/issues?q=is%3Aissue+is%3Aopen+label%3A%22module+update%22%2C%22new+module%22%2C%22all+modules%22), e.g. by listing good resources for information.\n- Author a new module by creating a [new issue and pr](#how-can-i-do-it), while taking into account the [documentation for creating a new module](https://github.com/esciencecenter-digital-skills/NEBULA-docs/blob/main/module-dir-structure.md)\n- Review a lesson module; both by looking at [open PRs](https://github.com/esciencecenter-digital-skills/research-software-support/pulls), as well as flagging issues for improvement in the [existing content](https://esciencecenter-digital-skills.github.io/research-software-support/).\n- [Provide feedback](https://github.com/esciencecenter-digital-skills/research-software-support/issues) on the different subjects covered: what did we miss? Should something be restructured?\n\n### How can I do it?\n\nIf you want to contribute to the content: look whether the issue you want to tackle [already exists](https://github.com/esciencecenter-digital-skills/research-software-support/issues) or make a [new issue](https://github.com/esciencecenter-digital-skills/research-software-support/issues/new), and [create a PR](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/creating-a-pull-request) with your changes from a fork or a branch. \n\nIt is useful to take a look at [the NEBULA documentation](https://github.com/esciencecenter-digital-skills/NEBULA-docs) and specifically review [the section on directory structure and content tags](https://github.com/esciencecenter-digital-skills/NEBULA-docs/blob/main/module-dir-structure.md) before you start. \n\n## Target audience\n\nThe target audience for this material is University management and support staff.\nUniversity management taking part in courses involving these modules may be involved in creating university policy around research software.\nThe University support staff targeted are not themselves researchers or software engineers, but they support researchers and research software engineers in creating research software.\n\nOn a practical level, this means that these modules do not need to be very technical.\nFor example, a module on version control does not need to explain the details of Git and the different commands.\nWhat it does need to do is explain why version control is important, and why it matters particularly in a research context.\nA participant should walk away with a more elaborate vocabulary around a subject, knowledge on where and how to find more information, and motivation that they could transfer to others.\n\n## Philosophy\n\nAs you are contributing to this material, please keep a few principles in mind:\n\n### The material should be broadly usable\n\nIt should be ready for teaching both online and offline; in a regular and a flipped classroom; and even for self study.\n\nThe modules in this repository will be used as lesson materials for a live audience, and provide a resource for self-study.\nEvery module should therefore contain some essential classroom elements (e.g. slides, group exercises), as well as exercises that can be done individually, and reference material that can be read at home.\n\n### The modules should be easy to (re)use\n\nIt is important that anybody can work with the material in this repository.\nSlides should therefore contain complete notes for an instructor, which can also be used in self-study.\nExercises should be clearly explained, and where possible, times should be given for different parts of the lesson so an instructor can plan a workshop around these materials.\n\n### Maintenance load should be kept to a minimum\n\nWe all know how fast things change, and how quickly information becomes outdated.\nIt is important to keep this in mind when creating lesson materials, and focus on core concepts, rather than specific tools and details.\nWhere it is useful to mention these, consider linking to external resources that will be maintained by others.\n\nIn general, it is better to link to external resources than to rewrite information that already exists elsewhere.\nThis, too, will limit the amount of maintenance that is required."},{"_path":"/license","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"LICENSE","description":"The content of the modules/ folder of this project is licensed under a Creative Commons Attribution 4.0 International License.","_type":"markdown","_id":"local_fs:LICENSE.md","_source":"local_fs","_file":"LICENSE.md","_stem":"LICENSE","_extension":"md","plainText":"<a rel=\"license\" href=\"https://creativecommons.org/licenses/by/4.0/\"><img alt=\"Creative Commons License\" style=\"border-width:0\" src=\"https://i.creativecommons.org/l/by/4.0/88x31.png\" /></a><br />The content of the `modules/` folder of this project is licensed under a <a rel=\"license\" href=\"https://creativecommons.org/licenses/by/4.0/\">Creative Commons Attribution 4.0 International License</a>.\n\nThis license does not apply to any image files in the `modules` folder or its subfolders.\nImage files are files with `.png`, `.jpg`, `.svg`, or `.gif` extensions.\n"}]