[{"_path":"/modules/testing/exercise1","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Exercise 1","description":"Choose an alternative that correctly answers the following questions:","type":"exercise","order":4,"_type":"markdown","_id":"local_fs:modules:testing:exercise1.md","_source":"local_fs","_file":"modules/testing/exercise1.md","_stem":"modules/testing/exercise1","_extension":"md","plainText":"---\ntitle: Exercise 1\ntype: exercise\norder: 4\n---\n\n# Exercise 1\n\nChoose an alternative that correctly answers the following questions:\n\n**1.1 What is software testing?**\n\na) A method for evaluating a software's compatibility with different operating systems.\n\nb) The process of releasing updates and patches for software.\n\nc) The process of verifying and validating that a software meets the required specifications and works as intended.\n\nd) A step in the software lifecycle focused on community engagement and feedback.\n\ne) The practice of documenting software functionalities.\n\n---\n\n**1.2 Why is software testing important?**\n\na) To build and maintain the community's trust by demonstrating commitment to quality.\n\nb) To identify and fix bugs, ensure the software meets required standards, and assess its reliability and reproducibility.\n\nc) To design the software's user interface and graphics.\n\nd) To accelerate the overall software development process.\n\ne) To facilitate easier collaboration among developers.\n\n---\n\n<small> **answers:** \n1.1 c) \n1.2 The most obvious answer is b), but in fact all answers except c) are correct\n</small>\n"},{"_path":"/modules/testing/exercise3","_dir":"testing","_draft":false,"_partial":false,"_locale":"","title":"Exercise 3","description":"","type":"exercise","order":6,"_type":"markdown","_id":"local_fs:modules:testing:exercise3.md","_source":"local_fs","_file":"modules/testing/exercise3.md","_stem":"modules/testing/exercise3","_extension":"md","plainText":"---\ntitle: Exercise 3\ntype: exercise\norder: 6\n---\n\n# Exercise 3\n\n## Scenario\n\nYou are part of a research team working on a complex simulation software that models climate change. The software is developed collaboratively by a diverse group of scientists, each contributing to different modules (e.g., ocean temperature modeling, atmospheric chemistry, etc.). The team has faced issues with code integration, where new contributions occasionally break existing functionalities or cause unexpected results, leading to delays in their research. You are considering the adoption of **Continuous Integration**.\n\n---\n\n## Question\n\nWhich of the following best describes Continuous Integration and its benefits for this project?\n\na) Continuous Integration is a practice where team members work in isolation to ensure their code is perfect before integrating it once at the end of the project, helping to avoid conflicts and errors.\n\nb) Continuous Integration involves the use of specialized software to automatically translate code into multiple programming languages, making it more versatile and reducing workload.\n\nc) Continuous Integration is a development practice where team members frequently integrate their work, often several times a day, to detect and fix integration issues early, thereby improving collaboration and code quality.\n\nd) Continuous Integration is a method where team members manually review each other's code at the end of each day, ensuring that the code meets quality standards and is ready for client presentation.\n\ne) Continuous Integration refers to the continuous updating of software to incorporate user feedback and new features, ensuring the software evolves to meet user needs.\n\n<small> correct answer: c) </small>"}]