[{"_path":"/modules/citation/introduction","_dir":"citation","_draft":false,"_partial":false,"_locale":"","title":"Citing software","description":"","type":"reading","order":2,"_type":"markdown","_id":"local_fs:modules:citation:introduction.md","_source":"local_fs","_file":"modules/citation/introduction.md","_stem":"modules/citation/introduction","_extension":"md","plainText":"---\ntitle: Citing software\ntype: reading\norder: 2\n---\n\n## Citing software\n\nSoftware has become a crucial part of scientific research, yet it is not cited or credited as often and as easily as traditional research outputs. However, it is important to properly cite software, for many reasons, among which:\n\n**Understanding Research Fields**: Software is a product of research, and by not citing it, we leave holes in the record of research of progress in those fields.\n\n**Recognition**: Academic researchers at all levels, including students, postdocs, faculty, and staff, should be credited for the software products they develop and contribute to, particularly when those products enable or further research done by others. Non-academic researchers should also be credited for their software work, though the specific forms of credit are different than for academic researchers. Furthermore, citations can be tracked, which allows for more accurate assessment of the software's impact: who uses it, and what projects does it contribute to?\n\n**Discovering Software**: Citations enable the specific software used in a research product to be found. Additional researchers can then use the same software for different purposes, leading to credit for those responsible for the software.\n\n**Reproducibility**: Citation of specific software used is a crucial step in allowing other researchers to reproduce your results, although it is not sufficient. Additional information such as configurations and platform issues are also needed. Accurate information about the software — and its version! — used in your research is necessary for others to obtain and use the same software, making it easier to validate and build upon your research.\n\nIn this module, we will further illustrate the importance of software citation, and we will demonstrate how scientific software can be cited, and how to facilitate this as the author of scientific software. Here, you will be introduced to the file type `CITATION.cff`, which was developed especially for this purpose.\n:::"},{"_path":"/modules/citation/slides-citation","_dir":"citation","_draft":false,"_partial":false,"_locale":"","title":"Software Citation","description":"===","type":"slides","order":1,"_type":"markdown","_id":"local_fs:modules:citation:slides-citation.md","_source":"local_fs","_file":"modules/citation/slides-citation.md","_stem":"modules/citation/slides-citation","_extension":"md","plainText":"---\ntitle: Software Citation\ntype: slides\norder: 1\n---\n\n<!-- .slide: data-state=\"title\" -->\n\n# Software Citation\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Why would you cite software?\n- Understanding Research Fields\n- Credit for the researcher\n- Recognition of the software\n- Discovering Software\n- Reproducibility\n\n\nNote:\n\n**Understanding Research Fields**: Software is a product of research, and by not citing it, we leave holes in the record of research of progress in those fields.\n\n**Credit**: Academic researchers at all levels, including students, postdocs, faculty, and staff, should be credited for the software products they develop and contribute to, particularly when those products enable or further research done by others. Non-academic researchers should also be credited for their software work, though the specific forms of credit are different than for academic researchers.\n\n**Discovering Software**: Citations enable the specific software used in a research product to be found. Additional researchers can then use the same software for different purposes, leading to credit for those responsible for the software.\n\n**Reproducibility**: Citation of specific software used is necessary for reproducibility, although not sufficient. Additional information such as configurations and platform issues are also needed.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n## The software citation principles\n\n- Importance\n- Credit and attribution\n- Unique Identification\n- Persistence\n- Accessibility\n- Specificity\n\n\n\nNote:\n\n**Importance**: Software should be considered a legitimate and citable product of research. Software citations should be accorded the same importance in the scholarly record as citations of other research products, such as publications and data; they should be included in the metadata of the citing work, for example in the reference list of a journal article, and should not be omitted or separated. Software should be cited on the same basis as any other research product such as a paper or a book, that is, authors should cite the appropriate set of software products just as they cite the appropriate set of papers.\n\n**Credit and Attribution**: Software citations should facilitate giving scholarly credit and normative, legal attribution to all contributors to the software, recognizing that a single style or mechanism of attribution may not be applicable to all software.\n\n**Unique Identification**: A software citation should include a method for identification that is machine actionable, globally unique, interoperable, and recognized by at least a community of the corresponding domain experts, and preferably by general public researchers.\n\n**Persistence**: Unique identifiers and metadata describing the software and its disposition should persist – even beyond the lifespan of the software they describe.\n\n**Accessibility**: Software citations should facilitate access to the software itself and to its associated metadata, documentation, data, and other materials necessary for both humans and machines to make informed use of the referenced software.\n\n**Specificity**: Software citations should facilitate identification of, and access to, the specific version of software that was used. Software identification should be as specific as necessary, such as using version numbers, revision numbers, or variants such as platforms.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n## What software to cite?\n\n*\"...the software itself should be cited on the same basis as any other research product; authors should cite the appropriate set of software products.\"*\n\nWhich software would you cite?\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n## How to make your software citable?\n##  \n## `CITATION.cff`\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n```\ncff-version: 1.2.0\nmessage: \"If you use this software, please cite it as below.\"\nauthors:\n  - family-names: Druskat\n    given-names: Stephan\n    orcid: https://orcid.org/1234-5678-9101-1121\ntitle: \"My Research Software\"\nversion: 2.0.4\nidentifiers:\n  - type: doi\n    value: 10.5281/zenodo.1234\ndate-released: 2021-08-11\n```\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\nwww.esciencecenter.nl\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"}]