[{"_path":"/modules/distributing/slides-distributing","_dir":"distributing","_draft":false,"_partial":false,"_locale":"","title":"Distributing Software","description":"===","type":"slides","order":1,"author":"Jaro Camphuijsen, Lourens Veen","_type":"markdown","_id":"local_fs:modules:distributing:slides-distributing.md","_source":"local_fs","_file":"modules/distributing/slides-distributing.md","_stem":"modules/distributing/slides-distributing","_extension":"md","plainText":"---\ntitle: Distributing Software\ntype: slides\norder: 1\nauthor: Jaro Camphuijsen, Lourens Veen\n---\n\n<!-- .slide: data-state=\"title blue_overlay yellow_flag yellow_strip purple_half_circle_bottom purple_blob right_e_top\" -->\n\n# Distributing Software\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Why distribute?\n\n1. For reproducibility/transparency of research\n2. For developers that want to reuse parts of your software/methods\n3. For users that want to use your software\n\nnote:\nThere are many potential reasons for distributing your software. In science, these three\nscenarios are the most common. Note that users and developers can include yourself!\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Kinds of software\n\n\nScript, program, notebook, package, library, image, container, it's confusing!\n\nLet's clear that up first\n\nnote:\nSoftware can seem very confusing, because there are many different terms that are used\nto describe various kinds of software, and they're often used sloppily as well. So let's\nstart with explaining a bit how software is put together, and what all these terms mean.\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Functions (or Procedures)\n\n<div style=\"width: 40%; float: left; margin-top: 3%\">\n\n- Ordered list of instructions\n- Like a recipe\n- Can refer to other recipes\n- Closed box\n\n</div>\n\n<div style=\"width: 60%; float: right; margin-top: 3%\">\n\n<pre style=\"font-size: 70%; text-align: left\">\ndef minmax(list_of_things):\n    sorted_things = sorted(list_of_things)\n    smallest = sorted_things[0]\n    largest = sorted_things[-1]\n    return smallest, largest\n</pre>\n\n</div>\n\nnote:\nTo start, let's simplify everything way down and look at a basic component of software,\nthe function. (There's more to it, but this is all we need here and gives a good idea.)\nA function, or procedure which is really a better term but not what most people use\nanymore, is a list of instructions, like a recipe.\n\nTo make lasagna, you use sheets of dough, Bechamel sauce, and tomato sauce, and stack\nthem up in alternating layers before cooking everything in the oven. Of course tomato\nsauce does not grow on trees, so you'll need a sub-recipe to make that, and it's the\nsame with functions: they call other functions.\n\nLike with cooking, where you might get some ready-made pasta or sauce, the functions\ncalled from a function can be made by someone else. Your laptop has tens or hundreds of\nthousands of functions in it to do everything it does.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Scripts and Notebooks\n\n<div style=\"width: 50%; float: left; margin-top: 3%\">\n\n- Single file with function(s)\n- Sit at the top of a pyramid\n- Use libraries\n- Run interactively\n- User handles errors\n\n</div>\n\n<div style=\"width: 50%; float: right; margin-top: 0%\">\n\n<img src=\"media/scripts_notebooks.png\" width=\"100%\">\n\n</div>\n\n\nnote:\nA script is a small bit of software, usually a single file with one or a few functions\nin it. A notebook is a script that is run in a special environment, like Jupyter, which\nshows the script as a document with blocks of code and results (e.g. graphs) embedded in\nit.\n\nScripts and notebooks are run interactively by a user, who can see the code and handles\nany errors, if they occur. The functions called by the functions in a script are usually\nnot in the script itself, but come from libraries.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Libraries\n\n<div style=\"width: 50%; float: left; margin-top: 5%\">\n\n- Lower levels of the pyramid\n- Ready-made functionality\n- Have an interface\n- Handle errors itself\n\n</div>\n\n<div style=\"width: 50%; float: right; margin-top: 0%\">\n\n<img src=\"media/scripts_notebooks.png\" width=\"100%\">\n\n</div>\n\n\nnote:\nLibraries are collections of functions intended for use by others, either other\nlibraries, or scripts, or even people. They contain ready-made functionality organised\naround a topic. For example there are plotting libraries that can make different kinds\nof graphs, or libraries that can solve particular kinds of equations.\n\nLibraries have an interface or API, which consists of functions that the user is\nsupposed to call. The library will probably have some internal functions as well.\nLibraries need to handle any errors if they occur, either by working around the problem\nor by reporting it to the user in a well-defined way.\n\nDesigning APIs and handling errors is hard, so making a good library is not so easy, but\nlibraries are very reusable.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Programs\n\n<div style=\"width: 50%; float: left; margin-top: 3%\">\n\n- At the top, or including all\n- Bigger than a script\n- End product, with user interface\n\n</div>\n\n<div style=\"width: 50%; float: right; margin-top: 3%\">\n\n<img src=\"media/programs.png\" width=\"100%\">\n\n</div>\n\nnote:\nProgram is a very generic term. A script is a small program, and the borderline isn't\nvery clear. A program can do things on its own, so a library is not a program. Programs\noften include all the libraries that they use, but you can also say that program X\ndepends on library Y. A program is not meant for programmers, but for end users, with\nwhich it communicates through some kind of user interface, be it graphical or using text\nor on the command line.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Packages\n\n<div style=\"width: 50%; float: left; margin-top: 3%\">\n\n- A file containing a collection of software\n- Intended for distribution\n- Usually holds a library or a program\n- Has metadata\n- Listed in a package index\n- Installed using a package manager\n\n</div>\n\n<div style=\"width: 50%; float: right; margin-top: 6%\">\n\n<img src=\"media/packages.png\" width=\"100%\">\n\n</div>\n\n\nnote:\nPackages are often used to distribute software. A package is an archive file (e.g. a\nZIP file) that contains software, usually a library or a program. There is also metadata\nthat describes, among other things, licenses and authors and other packages containing software that is\nneeded by this one.\n\nPackages are usually uploaded to a package index, an online store of packages where\nusers can find them and download them, e.g. PyPI or CRAN. Finding, downloading and\ninstalling is done using a tool called a package manager, like pip or conda.\n\nEspecially older programming languages may not have a standard package index or package\nmanager, e.g. C++ and Fortran.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Images and containers\n\n<div style=\"width: 50%; float: left; margin-top: 3%\">\n\n- A file containing a collection of software\n- Everything, including the OS\n- Cannot be combined\n- Can be run like a program, as a container\n\n</div>\n\n<div style=\"width: 50%; float: right; margin-top: 3%\">\n\n<img src=\"media/images_containers.png\" width=\"100%\">\n\n</div>\n\nnote:\nA virtual machine image or container image is a file containing a collection of\nsoftware, like a package. However, an image contains absolutely everything needed,\nincluding (most of) the operating system. If you have an image, then you can run the\nprogram inside it on your computer. This will create a kind of virtual computer inside\nyour computer (that's called a Virtual Machine or a Container) inside which the software\nruns. Containers cannot be combined and you can't call them from a script, so they're\nonly useful for programs, not for libraries, and the user needs special software to be\nable to run the program.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Scenario 1: Review & reproduce\n\n- You have a script\n- The script uses some libraries\n- You want others to see and run it\n\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Distributing scripts/notebooks\n\n- Make script/notebook available for download\n- Make environment file, e.g. requirements.txt, environment.yml\n- User uses a package manager to create environment\n- User runs the script/notebook\n- Optional: use an image (mostly long-term archival)\n\nnote:\nIn this case, you have a script or a notebook, and also an environment (e.g. using Conda\nor virtualenv) with the libraries you use installed in it. This environment is really\njust a folder on your computer with the libraries in it, and some machinery that makes\nit so that when the script calls a function that is in a library, the library will be\nfound and the function run.\n\nSo, you need to share your script or notebook of course, but the user will also need a\nsimilar environment to run it, otherwise those library functions are missing. You can\n(and should!) facilitate that by making an environment file that describes all the\npackages containing the libraries that you're using. If you then make that available,\nthe user can create a similar environment on their computer and run your script.\n\nSoftware that manages these environments, like Conda and pip/virtualenv, can make these\nenvironment files for you, and also read one and create an environment by downloading\nall the needed packages from the Internet, so this is not too difficult.\n\nAnother option is to use an image, but 1) they're very big, 2) they require special\nsoftware, and 3) they're much more work to create. They do have the advantage that they\nwork without an Internet, or in the future when all that old stuff is no longer online.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Scenario 2: A reusable method\n\n- You have created a new method\n- Should be somewhat generic\n- To be used by programmers\n- Needs a library!\n\nnote:\nScientists sometimes develop new methods for calculating something, for example\nacoustics in a room. They will likely have a script that calculates things for their\npaper, and that script can be shared as in Scenario 1, but it would also be nice if\npeople could use their method for calculating acoustics in all sorts of scenarios, in\ncombination with other calculations.\n\nIn this case, what's really needed is a library. As mentioned before, making libraries\nisn't that easy, so they may need some help from a Research Software Engineer to design\na good interface. Another option, and often a better one actually, is to contribute to\nan existing widely used library. That will give your code more exposure, and may get you\nsome help from its maintainers as well, in the form of reviews.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Distributing libraries\n\n- Make a package containing the library\n- Add metadata with dependencies\n- Upload the package to a repository\n\nnote:\nThe best way to distribute a library is by making a package for it, if there is a\nsuitable packaging system available. Most modern programming languages have one, e.g.\nPyPI and pip for Python, or CRAN and install.packages() for R, or Cargo for Rust.\n\nSo your steps here are to find the right packaging system based on the programming\nlanguage the library is written in, then creating a package for that system (there is\nusually a manual/tutorial available), and uploading the package to the repository so\nthat users can use their package manager to install it. Make sure to list all the\ndependencies in the metadata!\n\nFor languages like Fortran or C++ that don't have a standard package manager, you could\ntry Conda, or make packages for an operating system-specific packaging system like\nAPT/DPKG (Debian/Ubuntu Linux), DNF/RPM (Red Hat Linux), HomeBrew or macPorts (macOS) or\neven EasyBuild, Spack or Nix (on High-Performance Computing)\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Scenario 3: A whole application\n\n- Not so common in science\n- You have created a program\n- To be used by end users\n\nnote:\nScientists don't often make whole applications with user interfaces that anyone can just\npick up and use. That's a lot of work, and you don't get credit for it in science.\nNevertheless there are examples of this, e.g. MaxEnt in ecology, and it could happen. In\nthis case, what you have is a program.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Distributing programs\n\n- In an app store!\n- As an installer?\n- As a package?\n- As an image?\n\nnote:\nThere are a few options for distributing a program. Packaging systems can be used,\nespecially if the program is intended for use by programmers, or by more knowledgeable\nusers. An App Store is basically a packaging system for applications, and that would be\na good option too if available.\n\nAnother option is to make an installer. That's a single file that is a working program,\nlike a package, but it is also itself a program that when run will install your program\nonto the user's system. If you've installed software on Windows then you may have seen\none, although they've mostly been replaced by app stores and may cause the operating\nsystem to warn about suspicious software.\n\nFinally, you could make an image here, but as before, it would be very large, and it\nwould require special software on the user's computer, so in the here and now it's not a\ngood option. It would be more resistant to changes in the operating system that break\nthe program, because it includes the old version of the operating system. And then\nagain, running an old operating system is a security risk.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Updating software\n\n- Can't we just put it online and be done?\n- For scripts, you probably can\n- Libraries and programs need maintenance\n\n\nnote:\nScripts are built on top of libraries, which sit on top of an operating system, which\nsits on top of hardware, and all that stuff is constantly changing. Furthermore, people change and expect to use software in different ways over\ntime, and that also needs to be taken into account.\n\nFor example, the LimePy library in the AMUSE astrophysics software uses a function in\nthe SciPy library that does not exist anymore. The old version of SciPy it was written\nfor was designed for an old version of Python, which is no longer supported and\nshouldn't be used anymore, for security reasons. Also, a script using LimePy may use\nother libraries that require a newer SciPy, and you can't install multiple versions of\nthe same thing at the same time, so you won't be able to run that script anymore.\n\nBecause of this, all software needs to be updated from time to time in order to continue\nto work. This is tricky in science, which works in terms of projects that are finished\nand then replaced by something else. For scripts, it's probably not so important because\npeople can still read the script to see what you did, and update it if they see the\nneed.\n\nFor libraries and programs, it's a different story, because those are used over a longer\nperiod, and for libraries other things get built on top of them, and we'd like all that\nto continue to work.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Versioning\n\n- Use [Semantic Versioning](https://semver.org/) for libraries (X.Y.Z)\n- Less important for applications\n\nnote:\nFor libraries, it's important that you communicate about changes with programmers using\nyour library. If the changes affect your interface, then they will have to modify their\nsoftware to work with your new version. This is sometimes necessary and sometimes a good\nidea, as long as it doesn't happen too often. You do need to communicate it clearly\nhowever.\n\nA good way to do that is to use Semantic Versioning. This uses X.Y.Z versions, and from\nversion 1.0.0 promises that everything built on top of the library will continue to work\nas long as the first number remains the same. The second number is changed to mark\nadding new functions, and the third number is incremented if the new version only fixes\nbugs.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Summary\n\n- Script/notebook: publish with environment\n- Library: package and upload\n- Program: app store, package, installer\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\n[www.esciencecenter.nl](https://www.esciencecenter.nl)\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"},{"_path":"/modules/documentation/exercise-levels","_dir":"documentation","_draft":false,"_partial":false,"_locale":"","title":"Levels of documentation","description":"Joanne is working on her research software 'WeatherMap' that analyses and summarizes measurements from weather stations.","type":"exercise","order":3,"_type":"markdown","_id":"local_fs:modules:documentation:exercise-levels.md","_source":"local_fs","_file":"modules/documentation/exercise-levels.md","_stem":"modules/documentation/exercise-levels","_extension":"md","plainText":"---\ntitle: Levels of documentation\ntype: exercise\norder: 3\n---\n\n# When to use which documentation?\nJoanne is working on her research software 'WeatherMap' that analyses and summarizes measurements from weather stations.\n\nHere is a list of possible forms of documentation:\n1. A basic README file containing: quick installation instructions, two lines explaining why the software was created, \ntwo basic examples of how you can use the software.\n2. A tutorial: 'Finding unusual patterns in daily average temperatures using WeatherMap'.\n3. In-code documentation: Comments in her code that explain why she made certain implementation choices.\n5. API reference: Detailed description of each function/class of WeatherMap.\n6. Overview of components: A detailed overview of each component in the software.\n7. User documentation: Extensive documentation on how users can use each of the functionalities of WeatherMap.\n8. Naming: Logical names for functions, modules, and classes so that it is immediately clear what the corresponding piece of code does.\n\n\nFor the following scenarios, which forms of documentation would you suggest Joanne to incorporate in her project:\n\n## Scenario A:\nJoanne just started her PhD and is the only one using WeatherMap to create results for her first paper. \nShe does not really care about anyone else using her software.\n\n## Scenario B:\nJoanne works together with a few other PhD students in her research group on the software. \nShe wants to make it easier for other researchers in her group to also adopt the software, \nand finds it important that when she moves on to a different job that the software can be still be used and improved in her absence.\n\n## Scenario C:\nJoanne and her colleagues spend half of their time updating and improving WeatherMap. \nThey have a large community of users around the globe that depend on WeatherMap for their research.\n"}]