[{"_path":"/modules/softwaremanagementplans/slides-smp","_dir":"softwaremanagementplans","_draft":false,"_partial":false,"_locale":"","title":"Software Management Plans","description":"===","type":"slides","order":1,"_type":"markdown","_id":"local_fs:modules:softwaremanagementplans:slides-smp.md","_source":"local_fs","_file":"modules/softwaremanagementplans/slides-smp.md","_extension":"md","plainText":"---\ntitle: Software Management Plans\ntype: slides\norder: 1\n---\n\n<!-- .slide: data-state=\"title\" -->\n\n# Software Management Plans\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Mapping the Via Appia\n\n![Mapping the Via Appia](media/viaappia.png)\n\nNote:\nThe Via Appia was the most important road in the Roman Empire, connecting Rome to Brindisi in the south of Italy, spanning a distance of 540km.\nIt was used for military purposes, but also for trade and travel.\nThe Via Appia was built in 312 BC, and used for 600 years, until the fall of the Roman Empire.\n\nThe eScience Center participated in a project to map the Via Appia. Using a combination of satellite imagery and ground-based measurements, the project created a 3D model of the road. The model was used to study the road and its surroundings.\n\nIn this project, research software was used to process the satellite imagery and the ground-based measurements, and combine them into a 3D model of the Via Appia.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## The research life cycle\n\n<center>\n<img src=\"media/researchcycle.png\" width=\"60%\">\n</center>\n\nNote:\nAll over the research life cycle we can find examples of software created for research.\nSome are more straightforward than others:\n\n- Planning: to design experiments\n- Collecting: to collect data, to control instruments, to run simulations\n- Analysing: to analyse data, to generate models\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Reuse & reproduce\n\nBoth reusability and reproducibility are important values in research software:\n\n- **Reproducibility** is an integral part of the research process\n\n- Software **reusability** allows building upon existing software\n\nFor both, we need to be able to **find**, **access**, **use**, and **understand** software.\n\nNote:\nReproducibility of research allows validation of its findings, and is therefore vital in building a solid foundation for scientific progress.\nWe can only truly build upon existing research if we can reproduce its results.\n\nWhen software has been used in research, this has enormous potential to facilitate the research reproducibility.\nHowever, it also comes with its own particular challenges: software reproducibility is not always straightforward.\n\nAn additional feature of software, is that it may be a product on its own, and can be reused by others.\nThis is a great opportunity to build on our collective knowledge and tools, and to avoid reinventing the wheel.\n\nEnsuring that the software is findable, accessible, usable and understandable is key to both reproducibility and reusability.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n![Software Needs Maintenance](media/maintenance.png)\n\nNote:\nSoftware and code have some unique features.\nOne particular feature is that they depend on other software, and on the environment in which they are run.\nThis means that it requires maintenance and updates to keep it functional, as the environments around it change.\nThis is called software sustainability.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Overview\n\n- Software Management Plan: what and why?\n- Aspects of software management\n- Different needs for different software\n- SMP template examples\n\nNote:\nThis presentation will introduce you to the concept of software management plans, as a first step towards better software stewardship and sustainability.\nWe will look at different aspects of good software managements, as well as different needs for different types of software.\nFinally, we will take a look at some concrete examples of software management plans.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n### Software Management Plan (SMP)\n\n- Building on the success of Data Management Plans (DMPs)\n- A document detailing how research software will be managed\n  - What does it do?\n  - Who is it for?\n  - What resources does it need?\n  - Who is responsible?\n  - How long will it be available?\n  - ...\n- Can be part of a project proposal, or generated in the early phases\n\nNote:\nSoftware management plans (SMPs) are inspired by the earlier adopted data management plans.\nIn these documents, often created at or before the start of a project, plans and explicit decisions are made about various aspects around the management of these digital objects.\nThey are increasingly required by funders and institutions.\n\nIn an SMP it is explicitly stated what the software aims to do, who its target audience is, and what resources it is expected to need.\nIt also addresses the intended lifespan, and allocates responsibility: who makes releases? Who maintains the software at the end of the project, and if so for how long?\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Why use an SMP?\n\n- Make technical choices explicit\n- Plan for necessary resources\n- Assess whether new software is really needed\n- Clarity early on helps to avoid problems later\n- ...\n\nNote:\nWith an SMP, you make explicit plans and decisions in an early stage.\nThe SMP provides the team with structured, relevant questions early on, with the aim to maximize the accessibility, reusability, and impact of the software in question.\nThis supports good software management practices, and it makes sure they are known to the researchers involved.\n\nMore specifically, in an SMP you:\n\n- Make explicit technical choices. For example, what programming language will be used? What operating system will be supported?\n- Plan for necessary resources; be they financial, human, infrastructure or other.\n- Assess whether new software is really needed; explore whether existing software can be reused, and to what extent;\n\nThese are issues that arise during software development anyway, but all too often are not explicitly dealt with.\nBy tackling them early, a conscious decision can be made rather than needing to deal with consequences of implicit choices.\nResource planning moreover is vital for the sustainability of the software.\nFinally, the SMP will allow later verification of plans in a publicly funded project.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/smpguide.png\" width=\"50%\" />\n\n[doi:10.5281/zenodo.7038280](https://doi.org/10.5281/zenodo.7038280)\n\n</center>\n\nNote:\nTo get started on creating a Software Management Plan, this practical guide has been created by NWO and the Netherlands eScience Center.\nIts first version was released in August of 2022, but it has since been, and will continue to be, updated.\nAll past versions and the latest release are available on Zenodo via this DOI.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/groupedrequirements.png\" width=\"60%\" />\n</center>\n\nNote:\nIn the practical guide, the core requirements for an SMP are listed, and grouped into four categories.\n\nFocusing on the *engineering*, the guide asks about version control, packaging, testing, and software quality.\n\nFocusing on *documentation*, the guide discusses documentation needs for users, developers, and for deployment specifically.\n\nFocusing on *project management*, the guide addresses licensing, maintenance, resources, the project repository, and a risk analysis.\n\nFinally, the guide asks about the *purpose* of the software.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n<center>\n<img src=\"media/purpose.png\" width=\"40%\" />\n</center>\n\n- What problem does it solve?\n- Who is the intended audience?\n- What are its advantages and limitations?\n\nNote:\nThe software's purpose is a central question in the SMP.\n\nIt is important to be clear about the problem it addresses, and who the software is aimed at.\nAddressing the limitations of the software, as well as the advantages it will provide, help determine its scope.\nThis will help the developers focus on the specific needs of the software.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/engineering.png\" width=\"30%\" />\n</center>\n\n- What version control will you use?\n- How will you test the software?\n- How will the project be organized or packaged?\n- How will you manage code quality?\n\nNote:\nOn the engineering focus, several specific areas are addressed.\n\n*Version control* has a myriad of benefits: it allows keeping track of history and provenance, can support experimentation and collaboration, and is crucial for the identification of specific versions of the software.\n\n*Testing* ensures that software continues to work as intended.\nThere are many different approaches to this: units of code can be tested in unit tests; entire workflows can be verified in integration tests; acceptance tests can be created to ensure specific requirements are met; regression testing can be done to ensure new changes do not break existing functionality; and so on.\nDeciding whether and if so what testing will be implemented is an important element of the SMP.\n\n*Packaging* is important for the distribution of software.\nThe format in which the software will be distributed is an important decision that should be made early on.\n\n*Code quality* should be addressed: what standards will be adhered to, and how will they be measured and supported?\nThere are many tools that can help with this, and it is important to choose them early on to maintain consistent code quality throughout the project.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/documentation.png\" width=\"30%\" />\n</center>\n\n- What documentation will you provide\n  - for users?\n  - for developers?\n- How will you manage system requirements (e.g. dependencies)?\n\nNote:\nDocumentation is an important component of software, and should be tailored to different audiences.\n\nIn *user documentation*, the software's function should be explained, and instructions on how to use it should be provided.\n\nIn *developer documentation*, instructions on how to modify the software, and how to contribute to the project should be provided.\n\n*Deployment documentation* explains any system requirements (such as dependencies) for deploying the software, and installation and testing instructions.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/projectmanagement.png\" width=\"30%\" />\n</center>\n\n- What license will you use?\n- How will the software be maintained? For how long?\n- How should the software be cited?\n- What repository(ies) will you use?\n- What resources will you need?\n  - e.g. infrastructure, personnel, training, hardware...\n- What risks and challenges do you foresee?\n\nNote:\nThe project management focus is broad, and addresses various conditions for the software's long-term sustainability and re-use.\n\nAny reusable software should have an appropriate *license*, which is an important early decision.\n\nThe *maintenance* of the software should be addressed in an SMP: who will maintain it, and for how long?\nHow and when will it be retired?\n\nPlan the *citation* of the software: how will you collect information about its use? What DOI will you use for this?\n\nThe *repository* where the software will be deposited is preferably publicly accessible, and should allow users to obtain a functional copy of the software.\n\nWhat *resources* — human, infrastructure, financial - will be needed, and when?\n\nFinally, a *risk analysis* should be performed: for instance, are there privacy or security concerns? Is there potential for vendor lock, or other considerations for future reliability and reuse?\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## SMP template\n\n- Should be provided by the institution\n- Include guidance:\n  - Instructions on how to fill it out\n  - Resources for information and support\n  - Institution-specific regulations\n  - Institution-specific resources available\n- Include an assessment rubric (e.g. with (un)acceptable answers)\n\nNote:\nThe Software Management Plan template is a duty of the institution.\nA good SMP includes guidance on how to fill it out, including institution-specific regulations and resources.\n\nAn assessment rubric should accompany the template, indicating per question or focus what conditions need to be met, and which answers are (un)acceptable.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Not all software is equal\n\n![](media/softwarespectrum.png)\n\nNote:\nIt is important to realize when making an SMP, that research software comes in many shapes and sizes.\n\nAn ad-hoc R script written by a PhD student to analyse data from a specific machine, is research software.\n\nIt can also be a multinational collaboration to develop a tool that is used by thousands of researchers worldwide.\n\nDifferent software has different needs, but there are common principles in managing them and ensuring their sustainability.\n\nThe diversity of research software does mean that not all requirements apply to every type of software.\nTo address this, we can subset the core requirements to create different SMP templates tailored to software with different management needs.\n\nThe SMP Guide distinguishes software with low, medium, and high management needs.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## SMP level: low\n\n- Single purpose scripts\n- Developer is the primary user\n- Performs limited function:\n  - Analyses a single experiment or dataset\n  - Automates a routine task\n\nNote:\nSoftware with low management requirements is defined by its limited function: it performs a single analysis or automates a routine task.\nIts **purpose** is typically limited to a specific experiment, and the developer is the primary user.\n\nThe **reliability** of this type of software is usually easy to assess: the output can be visually inspected, or tested with a limited set of inputs.\n\nThe **maintenance** of this type of software is usually limited to the duration of the project in which it was developed.\nIt is not intended to be used by others, and therefore its influence beyond the scope for which it was intended is likely small.\n\nBest practices during development (e.g. version control), as well as measures to enable its reuse (documentation, versioning, archiving) are appropriate and recommended.\nThey are however not requirements, nor is long term maintenance planning necessary.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## SMP level: medium\n\n- Primary or secondary output of a research project\n- Adds a library or module to existing tool, or even works standalone\n- Unique functionality that will be reused\n  - Implements a new or higher performance algorithm\n  - Simulation software implementing a new model or method\n\nNote:\nSoftware requiring **medium** management, is defined as software that is the primary or secondary output of a research project.\n\nIts original **purpose** is typically limited to a single research project, but incorporates functionality that may be of use to others, either as a standalone tool, library, or module in an existing tool.\n\nThe **reliability** is more difficult to assess due to its increased complexity, but it is also also more important: this software likely has an effect on other research outside of the original project.\nGood software practices such as version control and user/technical documentation are therefore essential here.\nMore advanced requirements, such as code auditing, automated testing, software packaging, and distribution also need to be considered.\n\nThis software's longer term **maintenance** is relevant as it will have a lifespan longer than the project in which it was developed.\nSoftware management planning should include providing information on archiving and citation as well as strategies for post-project maintenance and support.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## SMP level: high\n\n- Mission critical software\n- High standards required for reliability\n- Absence or replacement of the software would threaten research\n- Software that is continually in use:\n  - Preprocessing data coming from a telescope\n  - Controlling a medical device\n\nNote:\n**High** management software is defined as mission critical software.\n\nIts **purpose** is to perform a critical function, and its absence or replacement would threaten the research.\n\nThe **reliability** of this software is of utmost importance, and all possible actions should be taken to ensure it.\n\nIts **maintenance** is not limited to the duration of the project in which it was developed, but should be maintained as long as it is in use.\nThus, maintenance strategies, including funding and/or community development plans, should be in place.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Making that call\n\n- **Purpose**: what is the reason or expected end-use for the software?\n- **Reliability**: what is the effect of software failure and/or non-maintenance?\n- **Maintenance**: what is the long-term effort needed to maintain the software?\n\nCheck the Practical Guide: [doi:10.5281/zenodo.7038280](https://doi.org/10.5281/zenodo.7038280)\n\nNote:\nDeciding what level of management, and therefore which SMP template, is appropriate for a specific software project, is not always straightforward.\nThe practical guide provides some guidance on how to make this decision.\nAddressing what purpose the software serves, how reliable it needs to be, and what efforts will be required for its longer term maintenance, will help determine the appropriate level of management.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n<center>\n<img src=\"media/threelevels.png\" width=\"60%\">\n</center>\n\nNote:\nWith a specific level of management in mind, the core requirements that are relevant for this software's management can be determined.\nThe practical guide provides a clear overview of this.\n\n===\n\n<!-- .slide: data-state=\"standard\" -->\n\n## Take home messages\n\n- Software is found in all stages of the research cycle\n- Research software comes in many shapes and sizes\n- Software stewardship starts with a good plan\n- Good software management leads to better science\n\nNote:\nSoftware is found in all stages of the research cycle, and is used for many different purposes.\nIt comes in many shapes and sizes, and has different needs.\nSoftware stewardship starts with a good plan, and is an important scientific step: good software management leads to better science.\n\n===\n\n<!-- .slide: data-state=\"keepintouch\" -->\n\n\nwww.esciencecenter.nl\n\ninfo@esciencecenter.nl\n\n020 - 460 47 70\n"},{"_path":"/modules/softwaremanagementplans/softwareassessment","_dir":"softwaremanagementplans","_draft":false,"_partial":false,"_locale":"","title":"Software Assessment","description":"In a live setting, this exercise is done in groups.\nEach group will be assigned a software project.\nThe group will then create an SMP for this project.","type":"exercise","order":3,"_type":"markdown","_id":"local_fs:modules:softwaremanagementplans:softwareassessment.md","_source":"local_fs","_file":"modules/softwaremanagementplans/softwareassessment.md","_extension":"md","plainText":"---\ntitle: Software Assessment\ntype: exercise\norder: 3\n---\n\n# Assess your software\n\n*In a live setting, this exercise is done in groups.\nEach group will be assigned a software project.\nThe group will then create an SMP for this project.*\n\n## Step 1: Choose a software project\n\nChoose a software project for this exercise, preferably one you are familiar with.\n\nIf you don't have a project in mind, you can use one of the following:\n\n- [ESMValTool](https://research-software-directory.org/software/esmvaltool)\n- [LitStudy](https://research-software-directory.org/software/litstudy)\n- [Haddock](https://research-software-directory.org/software/haddock3)\n- [worcs](https://cjvanlissa.github.io/worcs/index.html)\n- [democracy-topic-modelling](https://research-software-directory.org/software/democracy-topic-modelling)\n\nFind the Practical Guide at [tinyurl.com/SMP-guide](https://doi.org/10.5281/zenodo.7589725).\n\n## Step 2: Assess the management level needed\n\n- Look at the software repository or page in the Research Software Directory.\n- Assess what level of management the software needs: low, medium, or high.\n\nFor this, use the following considerations (section 5 in [the guide](https://doi.org/10.5281/zenodo.7589725)):\n\n1. **Purpose**. What is the current reason or expected end-use for developing the software?\n2. **Reliability**. The effect of software failure and/or non-maintenance on:\n    - Risk of harm to self or others. This includes injury, privacy violation, bias, and inappropriate content.\n    - Reputation. For example to self, institution or other.\n    - Research, either your own or of others. This effect could be due to an obvious software failure (\"crash\") or a hidden one, for example, returning inconsistent numerical results on different operating systems.\n3. **Maintenance**. The long-term effort needed to maintain the software as long as it might be used as a standalone tool or dependency. This includes maintenance functions that can extend beyond the lifespan of the original development project and includes fixing bugs, dependency management, operating system compatibility, and security issues.\n\nThis may not be a clear-cut decision, but that is fine.\nThe goal is to get a sense of the level of management needed.\nDiscuss with your group and come to a consensus.\n\n## Step 3: Fill in the SMP template\n\nFrom the assessment made in Step 1, get the requirements that match the level of management needed.\n\nCopy a template, and fill it in for your software project.\n"}]