[{"_path":"/modules/version-control/version_control_exercise","_dir":"version-control","_draft":false,"_partial":false,"_locale":"","title":"What to include in the repository","description":"","type":"exercise","order":3,"_type":"markdown","_id":"local_fs:modules:version-control:version_control_exercise.md","_source":"local_fs","_file":"modules/version-control/version_control_exercise.md","_stem":"modules/version-control/version_control_exercise","_extension":"md","plainText":"---\ntitle: What to include in the repository\ntype: exercise\norder: 3\n---\n\n## Exercise: Which of the following do you think should be part of a code repository (5-10 mins)\n\nDiscuss with your neighbor which of the following should be part of the code repository and why it should or should not.\n\n- installation instructions (i.e. detailed instructions on how to install the software)\n- user documentation (i.e. information for the users of the software about its functionality and features)\n- full dataset to reproduce figures from a paper\n- a few data files to test the functionality of the code base\n- in-line comments intended only for code developers\n"},{"_path":"/modules/version-control/version_control_terminology","_dir":"version-control","_draft":false,"_partial":false,"_locale":"","title":"Terminology","description":"","type":"reading","order":2,"_type":"markdown","_id":"local_fs:modules:version-control:version_control_terminology.md","_source":"local_fs","_file":"modules/version-control/version_control_terminology.md","_stem":"modules/version-control/version_control_terminology","_extension":"md","plainText":"---\ntitle: Terminology\ntype: reading\norder: 2\n---\n\n## Terminology\n* **Branch**: A parallel version of the code that allows independent development without affecting the main (set of) file(s). Each branch starts from an existing *commit* and can evolve separately, enabling multiple changes to be worked on simultaneously. Branches are commonly used for features, bug fixes, or experiments before merging them back into the main branch (often called the trunk or default branch).\n* **Commit (noun)**: A commit or changeset is a set of alterations packaged together, along with meta-information  about the alterations. A commit/changeset describes the exact differences between two successive versions in the *version control system's* *repository* of changes along with information about the context of these changes, e.g. author, date, description (*commit message*) and a pointer to the parent commit, as well as a unique ID (*commit hash*).\n* **Commit (verb)**: To write the changes made in a *working copy* into the *repository*.\n* **Commit hash**: A unique identifier (usually an SHA-1 hash in Git) that represents a specific *commit*. This hash is generated based on the commit’s content, metadata, and parent commit(s), ensuring that each commit has a distinct and immutable reference.\n* **Commit message**: A short description provided by the developer when creating a *commit*. It explains the purpose of the commit and helps others understand the changes. Good commit messages improve collaboration, history tracking, and debugging.\n* **Merge**: The process of integrating changes from one *branch* into another. Typically, a feature or bugfix branch is merged into the main branch to include the new changes. Merging combines the commit history and resolves differences between branches.\n* **Merge conflict**: A situation that occurs when two *branches* modify the same part of a file in incompatible ways. *Version control systems* require manual resolution to decide which changes should be kept before completing the merge.\n* **Pull/push**: Copy revisions/*commits* from one *repository* into another. Pull is initiated by the receiving repository, while push is initiated by the source. Fetch is sometimes used as a synonym for pull, or to mean a pull followed by an update. \n* **Pull/merge request**: Contributions to a source code *repository* that uses a distributed *version control system* are commonly made by means of a pull request or merge request (synonyms). The contributor requests the project maintainer to *pull* and *merge* their changes to integrate it into the code base, hence the name.\n* **Repository**: In *version control systems*, a repository is a database that contains a set of files and all changes that have been made to them over time, possibly on different branches.\n* **Version Control System**: A system that tracks changes to files over time, allowing collaboration, parallel development, and the ability to revert to previous states. Git is most commonly used for software in the present day.\n* **Working copy**: The working copy is the local copy of files from a *repository*. All work done to the files in a repository is initially done on a working copy, hence the name.\n\n[Git commands cheat sheet](https://training.github.com/downloads/github-git-cheat-sheet.pdf)\n"}]